ben/blog/2005-08-26-can-you-improve-on-emptiness.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Can You Improve On Emptiness</title>
<meta name="author" content="Ben" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Can You Improve On Emptiness</h1>
<p><strong>Tags:</strong> <span class="tags"><a href="tags/philosophy.html">philosophy</a></span></p>

<p>
A while ago Google published what they called the <a href="http://cruftbox.com/blog/archives/001031.html">"Google Aptitude Test"</a>, and one of the questions they posed (#9 I believe) involved improving on empty space. After reading
<a href="http://mathworld.wolfram.com/news/2004-10-13/google/">several answers</a> to this question, I thought that the correct answer should have been "nothing", for several reasons.
</p>

<p>
In terms of how it relates to Google, it appears to be one of their desired design goals. All right, simplicity might be the actual design goal, but you cannot achieve simplicity when you have a cluttered interface. Either way, as you look at the applications they have published (search, gmail, gtalk, etc), it all has a very simplistic, very small interface. Contrast their search homepage with that of Yahoo's. Google is very much interested in becoming a "portal", as gmail and talk both attest to. Yet, their homepage remains ever so sparse. So, I think its the right answer because it follows what Google is already attempting to achieve.
</p>

<p>
However, if we diverge into the more philosophical, I feel there is another reason that the answer of "nothing" is correct. Back when I was playing guitar more regularly, and I was reading a lot of guitar theory, one of the books I was reading, either the
<a href="http://www.amazon.com/exec/obidos/tg/detail/-/0881885894/qid=1125110854/sr=8-1/ref=pd_bbs_1/002-2774828-2670421?v=glance&amp;s=books&amp;n=507846">Advancing Guitarist</a> or the <a href="http://www.amazon.com/exec/obidos/tg/detail/-/0895240661/qid=1125110878/sr=8-1/ref=pd_bbs_1/002-2774828-2670421?v=glance&amp;s=books&amp;n=507846">Heavy Guitar Bible</a>, they mentioned that when soloing, it is often the rests in-between notes that make the solo interesting.
</p>

<p>
So it is with other things as well. The space between words and thoughts becomes the emphasis. If you have a blank page, you can write anything on it. It is blank, it can become anything, it is completely malleable. However, once you begin writing on it, it loses that potential. The page then is forced to represent an idea, solve an equation, or otherwise complete what has been started. It can no longer be anything you imagine.
</p>

<p>
Just so I can tie this to software somehow, it is similar to an undefined variable; it can be anything, at least until you assign something to it.
</p>

<p>
Rather then clutter up empty space with some complex math proof, or some essay, why not sit back and think about all the things that could go into that space. Therefore, the answer of "nothing" gives way to all that could be written or displayed on that empty space, without actually committing to anything. It gives us a chance to do what we do so rarely in life:
</p>

<p>
pause,
</p>

<p>
and
</p>

<p>
think.
</p>

<p>
Of course, by typing this all out, it kind of goes against what I just discussed, so I'll end this here, but I'll leave something more important to think about:
</p>




















<p>
&#x2026;
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2005-08-26</p>
<p class="author">Author: Ben</p>
</div>
</body>
</html>
